Res-firecracker-setEven-randomFront-v7/firecracker_t_4_c_6_frontVcpu_2_wrkVcpu_2/wrk.txt
Running 1m test @ http://frontend:5000
  4 threads and 6 connections
  Thread calibration: mean lat.: 5124.518ms, rate sampling interval: 17989ms
  Thread calibration: mean lat.: 5070.766ms, rate sampling interval: 17874ms
  Thread calibration: mean lat.: 5153.291ms, rate sampling interval: 18120ms
  Thread calibration: mean lat.: 5140.943ms, rate sampling interval: 18071ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    28.24s    10.31s    0.93m    70.72%
    Req/Sec   247.62      3.97   256.00     87.50%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   25.97s 
 75.000%   34.50s 
 90.000%   39.52s 
 99.000%    0.93m 
 99.900%    0.95m 
 99.990%    0.95m 
 99.999%    0.95m 
100.000%    0.95m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9928.703     0.000000            2         1.00
   14630.911     0.100000         4954         1.11
   19103.743     0.200000         9909         1.25
   23592.959     0.300000        14873         1.43
   24625.151     0.400000        19853         1.67
   25968.639     0.500000        24773         2.00
   29097.983     0.550000        27242         2.22
   31571.967     0.600000        29742         2.50
   32358.399     0.650000        32221         2.86
   33112.063     0.700000        34705         3.33
   34504.703     0.750000        37159         4.00
   36241.407     0.775000        38386         4.44
   36831.231     0.800000        39646         5.00
   37289.983     0.825000        40886         5.71
   37781.503     0.850000        42193         6.67
   38371.327     0.875000        43383         8.00
   38764.543     0.887500        43971         8.89
   39518.207     0.900000        44580        10.00
   41451.519     0.912500        45198        11.43
   43778.047     0.925000        45819        13.33
   46235.647     0.937500        46439        16.00
   47448.063     0.943750        46745        17.78
   48693.247     0.950000        47052        20.00
   49840.127     0.956250        47369        22.86
   50987.007     0.962500        47670        26.67
   52428.799     0.968750        47988        32.00
   53051.391     0.971875        48135        35.56
   53706.751     0.975000        48291        40.00
   54362.111     0.978125        48452        45.71
   54820.863     0.981250        48616        53.33
   55148.543     0.984375        48777        64.00
   55246.847     0.985938        48832        71.11
   55410.687     0.987500        48921        80.00
   55574.527     0.989062        49004        91.43
   55705.599     0.990625        49068       106.67
   55869.439     0.992188        49146       128.00
   55934.975     0.992969        49183       142.22
   56000.511     0.993750        49225       160.00
   56098.815     0.994531        49265       182.86
   56164.351     0.995313        49300       213.33
   56262.655     0.996094        49333       256.00
   56328.191     0.996484        49354       284.44
   56393.727     0.996875        49375       320.00
   56492.031     0.997266        49397       365.71
   56557.567     0.997656        49419       426.67
   56623.103     0.998047        49438       512.00
   56655.871     0.998242        49446       568.89
   56688.639     0.998437        49457       640.00
   56721.407     0.998633        49469       731.43
   56721.407     0.998828        49469       853.33
   56786.943     0.999023        49486      1024.00
   56786.943     0.999121        49486      1137.78
   56819.711     0.999219        49497      1280.00
   56819.711     0.999316        49497      1462.86
   56819.711     0.999414        49497      1706.67
   56852.479     0.999512        49505      2048.00
   56852.479     0.999561        49505      2275.56
   56885.247     0.999609        49513      2560.00
   56885.247     0.999658        49513      2925.71
   56885.247     0.999707        49513      3413.33
   56918.015     0.999756        49523      4096.00
   56918.015     0.999780        49523      4551.11
   56918.015     0.999805        49523      5120.00
   56918.015     0.999829        49523      5851.43
   56918.015     0.999854        49523      6826.67
   56918.015     0.999878        49523      8192.00
   56918.015     0.999890        49523      9102.22
   56918.015     0.999902        49523     10240.00
   56918.015     0.999915        49523     11702.86
   56918.015     0.999927        49523     13653.33
   56918.015     0.999939        49523     16384.00
   56950.783     0.999945        49526     18204.44
   56950.783     1.000000        49526          inf
#[Mean    =    28244.296, StdDeviation   =    10311.932]
#[Max     =    56918.016, Total count    =        49526]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  58990 requests in 1.00m, 24.36MB read
Requests/sec:    983.16
Transfer/sec:    415.72KB